# Pandas practice

In [2]:
import numpy as np
import pandas as pd

In [4]:
dict={
    'name':['Brijesh','nisarg','pratik'],
    'marks':[48,49,50],
    'city':['s.nagar','abad','kadi']
}

In [6]:
df=pd.DataFrame(dict)

In [7]:
df

      name  marks     city
0  Brijesh     48  s.nagar
1   nisarg     49     abad
2   pratik     50     kadi

In [12]:
# to convert data into csv
df.to_csv('abc.csv')

In [13]:
df.head()

      name  marks     city
0  Brijesh     48  s.nagar
1   nisarg     49     abad
2   pratik     50     kadi

In [15]:
df.tail()

      name  marks     city
0  Brijesh     48  s.nagar
1   nisarg     49     abad
2   pratik     50     kadi

In [16]:
df.describe()

       marks
count    3.0
mean    49.0
std      1.0
min     48.0
25%     48.5
50%     49.0
75%     49.5
max     50.0

In [18]:
df1=pd.read_csv('abc.csv')

In [19]:
df1

       name  speed     city
0  Rajdhani    100  s.nagar
1     tejas    120     abad
2     goods     50     kadi

In [21]:
df1.speed

0    100
1    120
2     50
Name: speed, dtype: int64

In [27]:
df1['speed'][0]=50

C:\Users\HP\AppData\Local\Temp/ipykernel_11180/2799818938.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['speed'][0]=50

In [30]:
df1.index=['one','two','three']

In [31]:
df1

           name  speed     city
one    Rajdhani     50  s.nagar
two       tejas    120     abad
three     goods     50     kadi

In [33]:
df2=pd.read_csv('uber.csv')

In [35]:
df2.head(5)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,01-01-2016 21:11,01-01-2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,01-02-2016 01:25,01-02-2016 01:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,01-02-2016 20:25,01-02-2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,01-05-2016 17:31,01-05-2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,01-06-2016 14:42,01-06-2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit